IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP5_CONTROLSS_ECAP5.xml
	<register id="CONTROLSS_ECAP5_ECCLR" acronym="CONTROLSS_ECAP5_ECCLR" offset="0x30" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Writing '1' clears MUNIT_2_ERROR_EVT2 interrupt flag" range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Writing '1' clears MUNIT_2_ERROR_EVT1 interrupt flag" range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Writing '1' clears MUNIT_1_ERROR_EVT2 interrupt flag" range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Writing '1' clears MUNIT_1_ERROR_EVT1 interrupt flag" range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_HRERRORWriting a 1 clears the HRERROR flag.  " range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_CMP" width="1" begin="7" end="7" resetval="0x0" description="Counter Equal Compare Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CTR_CMPWriting a 1 clears the CTR=CMP flag.  " range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_PRD" width="1" begin="6" end="6" resetval="0x0" description="Counter Equal Period Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CTR_PRDWriting a 1 clears the CTR=PRD flag.  " range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CTROVFWriting a 1 clears the CTROVF flag.  " range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT4Writing a 1 clears the CEVT4 flag.  " range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT3Writing a 1 clears the CEVT3 flag.  " range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT2Writing a 1 clears the CEVT2 flag.  " range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_CEVT1Writing a 1 clears the CEVT1 flag.  " range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="ECAP Global Interrupt Status Clear    0   |   ECAP_0_NO_EFFECTWriting a 0 has no effect. Always reads back a 0      1   |   ECAP_1_CLEARS_INTWriting a 1 clears the INT flag and enable further interrupts to be generated if any of the event flags are set to 1  " range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ECAP5_ECFRC" acronym="CONTROLSS_ECAP5_ECFRC" offset="0x32" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Writing '1' sets MUNIT_2_ERROR_EVT2 interrupt flag" range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Writing '1' sets MUNIT_2_ERROR_EVT1 interrupt flag" range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Writing '1' sets MUNIT_1_ERROR_EVT2 interrupt flag" range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Writing '1' sets MUNIT_1_ERROR_EVT1 interrupt flag" range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error Force interrupt    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CTR_CMPWriting a 1 sets the CTR_CMP flag.  " range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_CMP" width="1" begin="7" end="7" resetval="0x0" description="Force Counter Equal Compare Interrupt.  This event is only active in APWM mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CTR_CMPWriting a 1 sets the CTR_CMP flag.  " range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTR_PRD" width="1" begin="6" end="6" resetval="0x0" description="Force Counter Equal Period Interrupt.  This event is only active in APWM mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_CLEARS_CTR_PRDWriting a 1 sets the CTR_PRD flag.  " range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Force Counter Overflow    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CTROVFWriting a 1 to this bit sets the CTROVF flag.  " range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Force Capture Event 4.  This event is only active in CAP mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CEVT4Writing a 1 sets the CEVT4 flag.  " range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Force Capture Event 3.  This event is only active in CAP mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CEVT3Writing a 1 sets the CEVT3 flag.  " range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Force Capture Event 2.  This event is only active in CAP mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CEVT2Writing a 1 sets the CEVT2 flag.  " range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Force Capture Event 1. This event is only active in CAP mode.    0   |   ECAP_NO_EFFECT_0No effect. Always reads back a 0.      1   |   ECAP_1_SETS_CEVT1Sets the CEVT1 flag.  " range="1" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ECAP5_ECAPSYNCINSEL" acronym="CONTROLSS_ECAP5_ECAPSYNCINSEL" offset="0x3C" width="32" description="">
		<bitfield id="SEL" width="7" begin="6" end="0" resetval="0x1" description="These bits determines the source of SYNCIN signal. 0x0 : Disabled using SOC tieoff. 0x7F : Refer to SOC spec for details." range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRCTL" acronym="CONTROLSS_ECAP5_HRCTL" offset="0x40" width="32" description="">
		<bitfield id="CALIBCONT" width="1" begin="5" end="5" resetval="0x0" description="Continuous mode Calibration Select Bit: 0 Continuous mode disabled. 1 Continuous mode enabled. Calibration automatically restarts at end of current calibration cycle." range="5" rwaccess="RW"/> 
		<bitfield id="CALIBSTS" width="1" begin="4" end="4" resetval="0x0" description="Calibration status  Bit: 0 No active calibration cycle 1 Calibration cycle in progress" range="4" rwaccess="RO"/> 
		<bitfield id="CALIBSTART" width="1" begin="3" end="3" resetval="0x0" description="Calibration start  Bit: 0 No effect 1 Starts the calibration cycle" range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PRDSEL" width="1" begin="2" end="2" resetval="0x0" description="Calibration Period Match Select Bit: 0 Use SYSCLK Counter For Period Match (default at reset) 1 Reserved" range="2" rwaccess="RW"/> 
		<bitfield id="HRCLKE" width="1" begin="1" end="1" resetval="0x0" description="High Resolution Clock Enable Bit: 0 High resolution clock disabled (default at reset) 1 High resolution clock enabled. The clock should be enabled before enabling the high res function via the HRE bit." range="1" rwaccess="RW"/> 
		<bitfield id="HRE" width="1" begin="0" end="0" resetval="0x0" description="High Resolution Enable Bit: 0 High resolution mode disabled (default at reset) 1 High resolution mode enabled. Enabling this mode will connect the capture registers and edge event modes of the ECAP to be accessed by the High Res function.  Note: The High Res clock needs to be enabled (using the HRCLKE bit) first before enabling the module. Allow a certain start up stabilization period before enabling the module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRINTEN" acronym="CONTROLSS_ECAP5_HRINTEN" offset="0x48" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Calibration Period Check status Interrupt Enable:  0 Disable Calibration Period Check interrupt status 1 Enable Calibration Period Check interrupt status" range="2" rwaccess="RW"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Calibration done Interrupt Enable:  0 Disable Calibration done Interrupt  1 Enable Calibration done Interrupt" range="1" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRFLG" acronym="CONTROLSS_ECAP5_HRFLG" offset="0x4C" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Calibration period check status Flag Bit:  1 Indicates that calibration ended before PRDCHK due to overflow on one of the counters. 0 Indicates no event occurred.  Note: This bit remains latched until cleared by the user using the HRCLR [CALPRDCHKSTS] bit." range="2" rwaccess="RO"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Calibration Done Interrupt Flag Bit:  1 Indicates calibration cycle is completed 0 Indicates calibration cycle has not completed.  Note: This bit remains latched until cleared by the user using the HRCLR [CALIBDONE] bit." range="1" rwaccess="RO"/> 
		<bitfield id="CALIBINT" width="1" begin="0" end="0" resetval="0x0" description="Global calibration Interrupt Status Flag:  1 Indicates that an interrupt was generated from CALIBDONE or CALPRDCHKSTS. 0 Indicates no interrupt generated." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRCLR" acronym="CONTROLSS_ECAP5_HRCLR" offset="0x50" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Clear Calibration period check status Flag Bit:  1 Clears the CALPRDCHKSTS flag register bit. 0 No effect.  Note: H/W has priority over CPU writes if the user tries to clear a flag bit and an event occurs on the same cycle that tries to set the flag for the selected bit." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Clear Calibration Done Interrupt Flag Bit:  1 Clears the CALIBDONE interrupt flag register bit. 0 No effect.  Note: H/W has priority over CPU writes if the user tries to clear a flag bit and an event occurs on the same cycle that tries to set the flag for the selected bit." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CALIBINT" width="1" begin="0" end="0" resetval="0x0" description="Clear Global calibration Interrupt Flag 1 Clears the Global interrupt flag and enables further interrupts to be generated if any of the event flags are set. 0 No effect." range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRFRC" acronym="CONTROLSS_ECAP5_HRFRC" offset="0x54" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Force CALPRDCHKSTS flag: 0 No effect 1 Sets the CALPRDCHKSTS flag." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Force CALIBDONE flag: 0 No effect 1 Sets the CALIBDONE flag." range="1" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRCALPRD" acronym="CONTROLSS_ECAP5_HRCALPRD" offset="0x58" width="32" description="">
		<bitfield id="PRD" width="32" begin="31" end="0" resetval="0x4194303" description="Register to program calibration period. The period value is matched against HRSYSCLKCTR. On a match an interrupt is generated and the counter registers values are captured." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRSYSCLKCTR" acronym="CONTROLSS_ECAP5_HRSYSCLKCTR" offset="0x5C" width="32" description="">
		<bitfield id="HRSYSCLKCTR" width="32" begin="31" end="0" resetval="0x0" description="Current SYSCLK counter value" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRSYSCLKCAP" acronym="CONTROLSS_ECAP5_HRSYSCLKCAP" offset="0x60" width="32" description="">
		<bitfield id="HRSYSCLKCAP" width="32" begin="31" end="0" resetval="0x0" description="HRSYSCLKCTR is captures into this register at end of calibration cycle." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRCLKCTR" acronym="CONTROLSS_ECAP5_HRCLKCTR" offset="0x64" width="32" description="">
		<bitfield id="HRCLKCTR" width="32" begin="31" end="0" resetval="0x0" description="Current HRCLK counter value  Note: HRCLK is  not  synchronized to SYSCLK domain so reads may not be accurate" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRCLKCAP" acronym="CONTROLSS_ECAP5_HRCLKCAP" offset="0x68" width="32" description="">
		<bitfield id="HRCLKCAP" width="32" begin="31" end="0" resetval="0x0" description="HRCLKCTR is captures into this register at end of calibration cycle.  Note: HRCLK is  not  synchronized to SYSCLK domain so reads may not be accurate" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRDEBUGCTL" acronym="CONTROLSS_ECAP5_HRDEBUGCTL" offset="0x74" width="32" description="">
		<bitfield id="OBSERVE_SRC_SEL" width="4" begin="11" end="8" resetval="0x0" description="Select bits for selecting source for OBSERVE1 and OBSERVE2 registers 1000 HROUTH and HROUTL will read HR1OUT 1001 HROUTH and HROUTL will read HR2OUT 1010 HROUTH and HROUTL will read Capture Delayline 1 OBS1 1011 HROUTH and HROUTL will read Capture Delayline 2 OBS1 1100 HROUTH and HROUTL will read Capture Delayline 1 OBS2 1101 HROUTH and HROUTL will read Capture Delayline 2 OBS2" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="CALIB_INPUT_SEL" width="2" begin="5" end="4" resetval="0x0" description="Select bit for calibration input, can be used to get fault coverage using these inputs 00 CAPIN is one of 128 inputs selected by INPUTSEL 01 CAPIN is connected to CAPIN_MEMMAP_SOURCE 10 CAPIN is internally generated signal waveform with 8*HRCLK cycle high and 8*HRCLK cycle low, used for linearity check of capture delay line 1 11 CAPIN is internally generated signal waveform with 8*HRCLK cycle high and 8*HRCLK cycle low, delayed by half HRCLK, used for linearity check of capture delay line 2" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="CAPIN_MMAP_SOURCE" width="1" begin="2" end="2" resetval="0x0" description="Memory mapped CAPIN source Note : select CALIN source first, it may happen that you may see interrupt if MMAP source is different from current value of CAPIN. This is debug feature hence no additional HW is necessary to prevent this." range="2" rwaccess="RW"/> 
		<bitfield id="DELAYRESETDLINE" width="1" begin="1" end="1" resetval="0x0" description="Controls the reset delayline timing 0 reset is forced on next falling edge of HRCLK (1/2 cycle after capture) 1 reset is applied a cycle later (1 1/2 cycles after capture)" range="1" rwaccess="RW"/> 
		<bitfield id="DISABLEINVSEL" width="1" begin="0" end="0" resetval="0x0" description="Disable INVSEL Logic: 0 State machine controls inversion on input signal 1 CAPIN signal propagated into delay line without inversion, this means only rising edges can be measured" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRDEBUGOBSERVE1" acronym="CONTROLSS_ECAP5_HRDEBUGOBSERVE1" offset="0x78" width="32" description="">
		<bitfield id="HROUTH" width="32" begin="31" end="0" resetval="0x0" description="Reads raw output of HROUT capture delay line 1" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP5_HRDEBUGOBSERVE2" acronym="CONTROLSS_ECAP5_HRDEBUGOBSERVE2" offset="0x7C" width="32" description="">
		<bitfield id="HROUTL" width="32" begin="31" end="0" resetval="0x0" description="Reads raw output of HROUT capture delay line 2" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP5_MUNIT_COMMON_CTL" acronym="CONTROLSS_ECAP5_MUNIT_COMMON_CTL" offset="0x80" width="32" description="">
		<bitfield id="GLDSTRBSEL" width="7" begin="14" end="8" resetval="0x0" description="Global load strobe select to enable shadow to active loading 0x0 : Disabled with SOC level tieoff. 0x1 to 0x7F : Global load strobe from SOC level including ETPWM global load strobes." range="14 - 8" rwaccess="RW"/> 
		<bitfield id="TRIPSEL" width="7" begin="6" end="0" resetval="0x0" description="Trip signal select to disable and enable signal monitoring automatically  0x0 : Disabled, Trip signals does not affect signal monitoring, achieved with SOC level tieoff. 0x1 to 0x7F : Signal monioring is disabled when selected signal is high and enabled when it is low" range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP5_MUNIT_1_CTL" acronym="CONTROLSS_ECAP5_MUNIT_1_CTL" offset="0xC0" width="32" description="">
		<bitfield id="MON_SEL" width="4" begin="11" end="8" resetval="0x0" description="Type of monitoring  0 : High Pulse width  1 : Low Pulse width  2 : Period width from Rise to Rise  3 : Period width from fall to fall  4 : Monitor rise edge  5 : Monitor fall edge  6-15 : Reserved (High Pulse width)" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="DEBUG_RANGE_EN" width="1" begin="1" end="1" resetval="0x0" description="Debug mode enable. 0 : Debug mode is disabled. 1 : Debug mode of monitoring unit 1 is enabled to obtain the variation seen in the system for debug purpose. Range is captured in MUNIT_1_DEBUG_RANGE_MIN and MUNIT_1_DEBUG_RANGE_MAX registers  Toggle DEBUG_RANGE_EN to restart this process, this will initialize MUNIT_1_DEBUG_RANGE_MIN and MUNIT_1_DEBUG_RANGE_MAX registers." range="1" rwaccess="RW"/> 
		<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="0 : Monitoring unit 1 is disabled 1 : Monitoring unit 1 is enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP5_MUNIT_1_SHADOW_CTL" acronym="CONTROLSS_ECAP5_MUNIT_1_SHADOW_CTL" offset="0xC4" width="32" description="">
		<bitfield id="LOADMODE" width="1" begin="2" end="2" resetval="0x0" description="Load mode 0 : Active registers are loaded with shadow on next sync event  1 : Active registers are loaded with shadow on EPWMx.GLDLCSTRB event" range="2" rwaccess="RW"/> 
		<bitfield id="SWSYNC" width="1" begin="1" end="1" resetval="0x0" description="Copies Min and Max values from shadow to active registers immediately if MUNIT_1_SHADOW_CTL.SYNCI_EN is set." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SYNCI_EN" width="1" begin="0" end="0" resetval="0x0" description="Shadow Enable 0 : Disabled 1 : Enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP5_MUNIT_1_MIN" acronym="CONTROLSS_ECAP5_MUNIT_1_MIN" offset="0xD0" width="32" description="">
		<bitfield id="MIN_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Minimum value for monitoring" range="31 - 0" rwaccess="RW"/>
	</register>
